IdeaRS.OpenModel.Model.HingeTypeInDirrection
Type of hinge in the direction

IdeaRS.OpenModel.Model.HingeTypeInDirrection.NoHinge
No hinge defined

IdeaRS.OpenModel.Model.HingeTypeInDirrection.FullHinge
Full hinge, zero stiffness is aplied

IdeaRS.OpenModel.Model.HingeTypeInDirrection.Flexible
Initial stiffness is aplied

IdeaRS.OpenModel.Model.HingeTypeInDirrection.Nonlinear
Nonlinear function is aplied